"""
Площадь треугольника 📐
Программа считывает длины двух катетов прямоугольного треугольника и выводит его площадь.
Площадь = (катет1 * катет2) / 2.
Формат входных данных: два действительных числа, каждое на отдельной строке.
"""

# Решение
a = float(input())
b = float(input())

area = (a * b) / 2
print(area)
