"""
Задача:
Программа получает строку-разделитель и три строки.
Выводит вторую, третью и четвёртую строки через разделитель.
"""

separator = input()
line1 = input()
line2 = input()
line3 = input()

print(line1, line2, line3, sep=separator)
