Начало столетия
Определить, оканчивается ли год на два нуля.
Если да — «YES», иначе — «NO».

# Решение
  print("NO" if int(input()) % 100 else "YES")
