"""
Большое число
Вычислить a^b + c^d, где a, b, c, d — целые положительные числа.
"""

# Решение
a, b, c, d = int(input()), int(input()), int(input()), int(input())
result = a**b + c**d
print(result)
