"""
Дробная часть
Вывести дробную часть положительного действительного числа.
"""

# Решение
num = float(input())
print(num - int(num))
