"""
Задача:
Напишите программу, которая выводит "Привет, мир!"
"""
# Решение:
print("Привет, мир!")
