"""
Задача:
Вывести числа 4, 8, 15, 16, 23, 42 каждое на отдельной строке.
Использовать отдельный print() для каждого числа.
"""

print(4)
print(8)
print(15)
print(16)
print(23)
print(42)
