"""
Задача:
Вывести последовательность: 4 8 15 16 23 42
Числа должны идти через пробел.
Запрещено использовать готовую строку '4 8 15 16 23 42'.
Нужно использовать print() с несколькими аргументами.
"""

print(4, 8, 15, 16, 23, 42)
