"""
Задача:
Программа получает три строки и выводит их каждую на отдельной строке в том же порядке.
"""

line1 = input()
line2 = input()
line3 = input()

print(line1)
print(line2)
print(line3)
