"""
Задача:
Программа получает три строки и выводит их в обратном порядке, каждую на отдельной строке.
"""

line1 = input()
line2 = input()
line3 = input()

print(line3)
print(line2)
print(line1)
