"""
Принадлежность 1
Определить, принадлежит ли число x промежутку (-1, 17).
Границы: -1 не включительно, 17 не включительно.
"""

# Решение
x = int(input())

if -1 < x < 17:
    print("Принадлежит")
else:
    print("Не принадлежит")
