"""
Принадлежность 2
Определить, принадлежит ли число x промежутку [-3, 7].
Обе границы включительно.
"""

# Решение
x = int(input())

if -3 <= x <= 7:
    print("Принадлежит")
else:
    print("Не принадлежит")
