"""
Ход коня ♘
Определить, может ли конь попасть с первой клетки на вторую одним ходом.
Конь ходит буквой «Г»: (|dx|, |dy|) равно (1, 2) или (2, 1).
"""

# Решение
x1, y1, x2, y2 = [int(input()) for _ in range(4)]

dx = abs(x1 - x2)
dy = abs(y1 - y2)

if (dx == 1 and dy == 2) or (dx == 2 and dy == 1):
    print("YES")
else:
    print("NO")
