"""
Python is awesome 🐍
Вывести «Python is awesome!» 10 раз, каждый на отдельной строке.
"""

# Решение
for _ in range(10):
    print("Python is awesome!")
