"""
Последовательность чисел 1
Вывести все целые числа от m до n включительно.
"""

# Решение
m = int(input())
n = int(input())

for i in range(m, n + 1):
    print(i)
